/***********************************************************************************************
created: 		2020-2-13

author:			chensong

purpose:		nvenc  

输赢不重要，答案对你们有什么意义才重要。

光阴者，百代之过客也，唯有奋力奔跑，方能生风起时，是时代造英雄，英雄存在于时代。或许世人道你轻狂，可你本就年少啊。 看护好，自己的理想和激情。


我可能会遇到很多的人，听他们讲好2多的故事，我来写成故事或编成歌，用我学来的各种乐器演奏它。
然后还可能在一个国家遇到一个心仪我的姑娘，她可能会被我帅气的外表捕获，又会被我深邃的内涵吸引，在某个下雨的夜晚，她会全身淋透然后要在我狭小的住处换身上的湿衣服。
3小时候后她告诉我她其实是这个国家的公主，她愿意向父皇求婚。我不得已告诉她我是穿越而来的男主角，我始终要回到自己的世界。
然后我的身影慢慢消失，我看到她眼里的泪水，心里却没有任何痛苦，我才知道，原来我的心被丢掉了，我游历全世界的原因，就是要找回自己的本心。
于是我开始有意寻找各种各样失去心的人，我变成一块砖头，一颗树，一滴水，一朵白云，去听大家为什么会失去自己的本心。
我发现，刚出生的宝宝，本心还在，慢慢的，他们的本心就会消失，收到了各种黑暗之光的侵蚀。
从一次争论，到嫉妒和悲愤，还有委屈和痛苦，我看到一只只无形的手，把他们的本心扯碎，蒙蔽，偷走，再也回不到主人都身边。
我叫他本心猎手。他可能是和宇宙同在的级别 但是我并不害怕，我仔细回忆自己平淡的一生 寻找本心猎手的痕迹。
沿着自己的回忆，一个个的场景忽闪而过，最后发现，我的本心，在我写代码的时候，会回来。
安静，淡然，代码就是我的一切，写代码就是我本心回归的最好方式，我还没找到本心猎手，但我相信，顺着这个线索，我一定能顺藤摸瓜，把他揪出来。
ËÙÂÊ¿ØÖÆ

NVENC Ö§³Ö¶àÖÖËÙÂÊ¿ØÖÆÄ£Ê½£¬²¢Í¨¹ý½á¹¹NV_ENC_INITIALIZE_PARAMS::encodeConfig::rcParamsÌá¹©¶ÔÓëËÙÂÊ¿ØÖÆËã·¨Ïà¹ØµÄ¸÷ÖÖ²ÎÊýµÄ¿ØÖÆ . ËÙÂÊ¿ØÖÆËã·¨ÔÚ NVENC ¹Ì¼þÖÐÊµÏÖ¡£
NVENC Ö§³ÖÒÔÏÂËÙÂÊ¿ØÖÆÄ£Ê½£º
ºã¶¨±ÈÌØÂÊ (CBR)£ººã¶¨±ÈÌØÂÊÉèÖÃrateControlMode Îª NV_ENC_PARAMS_RC_CBR. ÔÚÕâÖÖÄ£Ê½ÏÂ£¬Ö»ÓÐaverageBitRateÐèÒª²¢ÓÃ×÷ËÙÂÊ¿ØÖÆËã·¨µÄÄ¿±êÊä³ö±ÈÌØÂÊ¡£¿Í»§¶Ë¿ÉÒÔÊ¹ÓÃNV_ENC_RC_PARAMS::lowDelayKeyFrameScaleÀ´¿ØÖÆ I Ö¡Óë P Ö¡µÄ±ÈÂÊ£¬Èç¹û I Ö¡×îÖÕÉú³É´óÁ¿±ÈÌØ£¬Õâ¶ÔÓÚ±ÜÃâÐÅµÀÓµÈûºÜÓÐÓÃ¡£ÉèÖÃNV_ENC_CONFIG_H264/ NV_ENC_CONFIG_HEVC::enableFillerDataInsertion = 1ÒÔ·ÀÐèÒªÑÏ¸ñ×ñÊØ±ÈÌØÂÊ¡£
¿É±ä±ÈÌØÂÊ (VBR)£º¿É±ä±ÈÌØÂÊÉèÖÃrateControlMode Îª NV_ENC_PARAMS_RC_VBR¡£ ±àÂëÆ÷³¢ÊÔ·ûºÏÆ½¾ù±ÈÌØÂÊaverageBitRate£¬²¢ÔÚ±àÂëµÄÈÎºÎÊ±¼ä²»ÄÚ³¬¹ýmaxBitRate¡£ÔÚÕâÖÖÄ£Ê½ÏÂ£¬averageBitRate±ØÐëÖ¸¶¨¡£Èç¹ûmaxBitRateÎ´Ö¸¶¨£¬NVENC »á½«ÆäÉèÖÃÎªÄÚ²¿È·¶¨µÄÄ¬ÈÏÖµ¡£ÎªÁË¸üºÃµÄ¿ØÖÆ£¬½¨Òé¿Í»§¶ËÍ¬Ê±Ö¸¶¨ÕâÁ½¸ö²ÎÊýmaxBitRateºÍaverageBitRate¡£
ºã¶¨ QP£º´ËÄ£Ê½ÉèÖÃrateControlModeÎª NV_ENC_PARAMS_RC_CONSTQP. ÔÚÕâÖÖÄ£Ê½ÏÂ£¬Õû¸öÖ¡Ê¹ÓÃÖ¸¶¨µÄ QP (NV_ENC_RC_PARAMS::constQP)±àÂë¡£
Ä¿±êÖÊÁ¿£º´ËÄ£Ê½ÉèÖÃrateControlModeÎªVBR ºÍËùÐèµÄÄ¿±êÖÊÁ¿targetQuality. ´ËÄ¿±êÖÊÁ¿µÄ·¶Î§ÊÇ 0 µ½ 51£¨ÊÓÆµ±à½âÂëÆ÷ SDK 8.0 ¼°¸ü¸ß°æ±¾Ò²Ö§³ÖÐ¡ÊýÖµ£©¡£ÔÚÕâÖÖÄ£Ê½ÏÂ£¬±àÂëÆ÷Í¨¹ýmaxBitRateÖÐÖ¸¶¨µÄ±ÈÌØÂÊ²ÎÊýµÄ±ä»¯À´±£³ÖÃ¿Ö¡µÄÖÊÁ¿. Òò´Ë£¬×îÖÕµÄÆ½¾ù±ÈÌØÂÊ¿ÉÄÜ»áÒòÕýÔÚ±àÂëµÄÊÓÆµÄÚÈÝ¶øÓÐºÜ´ó²îÒì¡£Èç¹ûmaxBitRateÎ´Ö¸¶¨£¬±àÂëÆ÷½«¸ù¾ÝÐèÒªÊ¹ÓÃ¾¡¿ÉÄÜ¶àµÄÎ»À´ÊµÏÖÄ¿±êÖÊÁ¿¡£È»¶ø£¬Èç¹ûmaxBitRateÉèÖÃºó£¬Ëü½«ÐÎ³ÉÊµ¼Ê±ÈÌØÂÊµÄÉÏÏÞ¡£Èç¹ûmaxBitRateÔÚ´ËÄ£Ê½ÏÂÉèÖÃ¹ýµÍ£¬±ÈÌØÂÊ¿ÉÄÜ»áÊÜµ½ÏÞÖÆ£¬µ¼ÖÂ¿ÉÄÜÎÞ·¨ÊµÏÖËùÐèµÄÄ¿±êÖÊÁ¿¡£

 

$(CUDA_PATH)\lib\x64\cuda.lib
$(CUDA_PATH)\lib\x64\cudadevrt.lib
$(CUDA_PATH)\lib\x64\cudart.lib
$(CUDA_PATH)\lib\x64\cudart_static.lib
$(CUDA_PATH)\lib\x64\OpenCL.lib


************************************************************************************************/
 
#ifndef _NVIDIA_ENCODER_H
#define _NVIDIA_ENCODER_H

#include "encoder_info.h"

// Video-Codec-SDK Version: 8.2
#include "NvEncoder/NvEncoderD3D11.h" 
namespace chen {
extern struct encoder_info nvenc_info;
extern uint32 g_gpu_index;;
extern DXGI_FORMAT g_dxgi_format;
}
#endif
